In [25]:
data = {'Department': ['HR', 'IT', 'HR', 'IT', 'Finance', 'Finance', 'IT', 'HR'],
        'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Grace', 'Helen'],
        'Salary': [50000, 70000, 45000, 80000, 60000, 62000, 72000, 48000],
        'Experience': [5, 7, 4, 10, 8, 6, 9, 3]}

In [26]:
import pandas as pd
df=pd.DataFrame(data)

In [27]:
df

  Department Employee  Salary  Experience
0         HR    Alice   50000           5
1         IT      Bob   70000           7
2         HR  Charlie   45000           4
3         IT    David   80000          10
4    Finance      Eve   60000           8
5    Finance    Frank   62000           6
6         IT    Grace   72000           9
7         HR    Helen   48000           3

In [28]:
avg_sal = df.groupby('Department', as_index=False)['Salary'].mean().rename(columns={'Salary': 'Avg Salary'})
print(avg_sal)

  Department    Avg Salary
0    Finance  61000.000000
1         HR  47666.666667
2         IT  74000.000000

In [29]:
import pandas as pd
marks_data = {
    'Student': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Grace', 'Helen'],
    'Subject': ['Math', 'Math', 'Math', 'Science', 'Science', 'Science', 'Math', 'Science'],
    'Marks': [85, 78, 92, 88, 76, 95, 89, 80]
}
df1 = pd.DataFrame(marks_data)

In [30]:
avg_marks = df1.groupby('Subject', as_index=False)['Marks'].mean().rename(columns={'Marks': 'Average Marks'})

In [31]:
max_marks = df1.groupby('Subject', as_index=False)['Marks'].max().rename(columns={'Marks': 'Highest Marks'})
min_marks = df1.groupby('Subject', as_index=False)['Marks'].min().rename(columns={'Marks': 'Lowest Marks'})

In [32]:
print(avg_marks)
print(max_marks)
print(min_marks)

   Subject  Average Marks
0     Math          86.00
1  Science          84.75
   Subject  Highest Marks
0     Math             92
1  Science             95
   Subject  Lowest Marks
0     Math            78
1  Science            76